Repository: hadley/stringr
Catalog: po/R-*.po
Languages: es

source: {.arg pattern} must be a plain string, not a stringr modifier.
es: {.arg pattern} debe ser una cadena de caracteres, no un modificador de stringr

source: Invalid template string for interpolation.
es: Plantilla de cadenas invalida para interpolación.

source: Failed to parse input {.str {text}}
es: Fallo en segmentar el input {.str {text}}

source: {.arg pattern} must be a regular expression.
es: {.arg pattern} debe ser una expresión regular.

source: {.arg pattern} must be a string, not {.obj_type_friendly {x}}.
es: {.arg pattern} debe ser una cadena de caracteres, no {.obj_type_friendly {x}}.

source: Failed to apply {.arg replacement} function.
es: Fallo en aplicar la función {.arg replacement}.

source: It must accept a character vector of any length.
es: Debe aceptar un vector de caracteres de cualquier longitud.

source: {.arg replacement} function must return a character vector, not {.obj_type_friendly {new_flat}}.
es: La función {.arg replacement} debe devolver un vector de caracteres, no {.obj_type_friendly {new_flat}}.

source: {.arg replacement} function must return a vector the same length as the input ({length(old_flat)}), not length {length(new_flat)}.
es: La función {.arg replacement} debe devolver un vector del mismo largo que el input ({length(old_flat)}), no de {length(new_flat)} de largo.

source: {.arg i} must not be 0.
es: {.arg i} no debe ser igual a 0.

source: `width` ({width}) is shorter than `ellipsis` ({str_length(ellipsis)}).
es: `width` ({width}) es más corto que `ellipsis` ({str_length(ellipsis)}).

source: {.arg pattern} can't be a boundary.
es: {.arg pattern} no puede ser un límite.

source: {.arg pattern} can't be the empty string ({.code ""}).
es: {.arg pattern} no puede ser una cadena de caracteres vacia ({.code ""}).
